Revit 2027 API
LinearDimension.Create Method
 Creates a new instance of an Linear Dimension element within the project.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static LinearDimension Create(
	Document document,
	View dbView,
	Line line,
	IList<Reference> references
)
Public Shared Function Create (
	document As Document,
	dbView As View,
	line As Line,
	references As IList(Of Reference)
) As LinearDimension
public:
static LinearDimension^ Create(
	Document^ document,
	View^ dbView,
	Line^ line,
	IList<Reference^>^ references
)
static member Create :
        document : Document *
        dbView : View *
        line : Line *
        references : IList<Reference> -> LinearDimension
Parameters
document Document
 The document where new Linear Dimension is created.
dbView View
 The view in which the Linear Dimension will appear.
line Line
 The line of the annotation
references IList<Reference>
 references that the Linear Dimension will witness.
Return Value
LinearDimension
 The newly created Linear Dimension instance, or null if the operation fails.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
LinearDimension Class
Autodesk.Revit.DB Namespace